{
    "directions": [
        "Remove tofu block from the package and discard liquid. Wrap tofu in cheesecloth, place on a plate, and cover with a heavy pot until remaining liquid has been squeezed out, about 10 minutes. Remove the cheesecloth and cut tofu into 20 1-inch, bite-sized pieces. Place in a freezer-safe container and freeze, 8 hours to overnight.",
        "Remove tofu from freezer and thaw on paper towels or a dry cheesecloth. Pat dry.",
        "While tofu is thawing, put cornstarch into a resealable plastic bag. Pour rice milk into a small bowl.",
        "Preheat an air fryer to 375 degrees F (190 degrees C).",
        "Place tofu into the bag with the cornstarch, seal, and shake to coat the tofu pieces completely. Remove tofu pieces and dredge each piece in rice milk.",
        "Place bread crumbs, garlic powder, paprika, onion powder, and pepper in the resealable plastic bag with the cornstarch residue; shake until well mixed. Place each piece of tofu, one at a time, back in the bag with the bread crumbs. Shake the bag until tofu piece is completely coated, tap gently to shake off excess, and place tofu on a wire rack while you repeat with remaining tofu pieces.",
        "Add coated tofu to the air fryer basket and cook for 10 minutes. Shake the basket to loosen the pieces. Cook for another 3 minutes or until browned.",
        "Place 1/3 cup buffalo sauce in a bowl, add cooked tofu bites, and toss to coat. Drizzle remaining buffalo sauce over tofu and continue tossing to coat. Serve immediately."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7111042.jpg",
    "ingredients": [
        "1 (8 ounce) container extra-firm tofu",
        "4 tablespoons cornstarch",
        "4 tablespoons unsweetened rice milk",
        "¾ cup panko bread crumbs",
        "⅛ teaspoon garlic powder",
        "⅛ teaspoon paprika",
        "⅛ teaspoon onion powder",
        "⅛ teaspoon freshly ground black pepper",
        "⅔ cup vegan Buffalo wing sauce (such as Frank's®)"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Air Fryer Vegan Buffalo Tofu Bites",
    "url": "https://www.allrecipes.com/recipe/275939/air-fryer-vegan-buffalo-tofu-bites/"
}