{
    "directions": [
        "Mix 1 cup flour, water, and salt together to make a soft dough. Spray dough and work surface with olive oil; knead dough until smooth but still a little sticky.",
        "Set dough aside and cover with a warm, damp cloth. Let dough rest for at least 10 minutes.",
        "Preheat a large griddle while rolling out the tortillas.",
        "Divide dough into 8 equal parts. Form into smooth balls and flatten the tops. Roll balls in 1/4 cup flour and roll out into 6-inch circles. Dust rolling pin or work surface very lightly with flour if dough sticks. Brush tortillas with vegan margarine on one side.",
        "Place tortillas on the preheated griddle greased-side down. Cook until tortillas change color and start puffing up, about 10 seconds. Flip over and press puffed parts lightly with a flat spatula. Flip again. Cook just until golden-brown spots appear on both sides; tortillas should still be soft and pliable.",
        "Keep tortillas stacked together on and under a cloth to keep from drying out.",
        "Pulse cauliflower florets in a food processor until chopped into rice-sized pieces.",
        "Heat olive oil in a large skillet over medium-high heat. Cook cauliflower, onion, and serrano pepper until softened, about 5 minutes. Mix in ketchup, chili powder, and cumin.",
        "Process black beans in the food processor until smooth. Stir into the cauliflower mixture until heated through, about 5 minutes. Season with salt and pepper. Use 1/4 cup of the mixture for each tortilla."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "1 ¼ cups white whole wheat flour, divided",
        "½ cup lukewarm water",
        "¼ teaspoon salt",
        "olive oil cooking spray",
        "2 teaspoons vegan margarine (such as Earth Balance®)",
        "1 large head cauliflower, cut into florets",
        "1 tablespoon olive oil",
        "½  yellow onion, sliced",
        "1  serrano pepper, sliced",
        "2 tablespoons ketchup",
        "1 ½ teaspoons chili powder",
        "1 ½ teaspoons ground cumin",
        "1 (15 ounce) can low-sodium black beans, drained",
        "ground black pepper to taste",
        "½ teaspoon sea salt"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Black Bean-Cauli Tacos with Homemade Tortillas",
    "url": "https://www.allrecipes.com/recipe/268020/black-bean-cauli-tacos-with-homemade-tortillas/"
}