{
    "directions": [
        "Combine cauliflower, onion, carrots, cucumber, beans, and salt in a large bowl and toss well. Leave for 24 hours.",
        "The next day, rinse vegetables thoroughly in several changes of cold water. Drain well in a colander for 30 minutes.",
        "Inspect eight 12-ounce jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until picalilli is ready. Wash new, unused lids and rings in warm soapy water.",
        "Combine flour, curry powder, turmeric, mustard powder, and ginger in a large pot. Gradually stir in 1/2 the vinegar, blending well until a smooth paste without lumps forms. Add remaining vinegar and sugar, mix well, and bring to a boil over medium heat, stirring continuously. Cook until mixture thickens, about 5 minutes. Add vegetable mixture and bring to a boil. Cook for 2 minutes. Remove from heat.",
        "Pack picalilli into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any spills. Top with lids and screw rings on tightly.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 5 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all).",
        "Leave for 1 month, to allow picalilli to mature, before eating."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1936&h=968&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5723905.jpg",
    "ingredients": [
        "1 large head cauliflower, cut into small florets",
        "3 medium onion, diced",
        "3 large carrots, quartered lengthwise and sliced",
        "1 large cucumber - peeled, seeded, and diced",
        "½ pound fresh green beans, sliced diagonally",
        "½ cup salt",
        "10 tablespoons all-purpose flour, sifted",
        "2 tablespoons mild curry powder",
        "2 tablespoons ground turmeric",
        "¼ cup dry mustard",
        "4 tablespoons ground ginger",
        "4 cups white (distilled) malt vinegar",
        "2 ¾ cups white sugar"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "British Picalilli",
    "url": "https://www.allrecipes.com/recipe/267549/british-picalilli/"
}