{
    "directions": [
        "Place potato into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and mash. Set aside to cool.",
        "Heat oil in a skillet over medium heat. Add mustard seeds and cumin seeds and stir. Add carrots, onion, green chile, garlic, turmeric, and ginger. Cook and stir for 1 minute. Add mashed potato, cabbage, and tofu and stir again. Add water and cilantro; cook and stir until vegetables are soft and water is dried up, 7 to 8 minutes. Add garam masala and salt and stir well. Remove from heat and set aside to cool.",
        "Mix flour, water, and salt together in a bowl. Knead into a ball; continue kneading until dough is very soft, 10 to 12 minutes. Wrap and rest for at least 1 hour.",
        "Take a knob of dough and roll out into small round, about 4 inches in diameter. Spoon a heaped teaspoon of filling in the center and moisten the edge with a little water. Press edges together, overlapping the top slightly to form a pleat, and continue to create a half-moon shape with little pleats all around the edge. Repeat with remaining dough and filling.",
        "Fit a large pan with a steamer basket and add about 2 inches of water. Bring to a boil. Add dumplings and steam until swollen and cooked through, about 15 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4608&h=2304&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5762698.jpg",
    "ingredients": [
        "1  potato",
        "2 teaspoons vegetable oil",
        "1 tablespoon mustard seed",
        "¼ teaspoon cumin seeds",
        "2  carrots, finely diced",
        "1  onion, finely chopped",
        "1  green chile, finely chopped",
        "1 clove garlic, finely chopped",
        "1 teaspoon ground turmeric",
        "1 teaspoon grated ginger",
        "½ cup finely shredded cabbage",
        "¼ (14 ounce) package firm tofu, crumbled",
        "½ cup water",
        "¼ cup chopped fresh cilantro",
        "1 teaspoon garam masala",
        "salt to taste",
        "3 cups all-purpose flour",
        "1 cup water",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Buddhist Monk Dumplings",
    "url": "https://www.allrecipes.com/recipe/266320/buddhist-monk-dumplings/"
}