{
    "directions": [
        "Preheat the oven to 375 degrees F (190 degrees C). Liberally spray the bottom and sides of a 10x15-inch oven-proof glass dish or two 9x5-inch loaf pans with cooking spray.",
        "Combine coconut sugar, oat flour, cocoa, cacao powder, and baking powder in a large bowl. Mix well until no lumps remain, using a sifter if necessary. Set aside.",
        "Place chocolate chips in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes.",
        "Combine zucchini, grapeseed oil, flaxseed, and vanilla extract in a blender; blend on high until completely smooth and slightly warm, 1 to 1 1/2 minutes. Pour zucchini mixture into the melted chocolate; continue heating and stirring with a rubber spatula, scraping down the sides, until mixture is well combined. Remove top bowl from the heat.",
        "Fold the coconut sugar mixture into the zucchini-chocolate mixture, until mixture is combined but still slightly lumpy; do not overmix. Batter will be very thick with a smooth texture. Let sit for 5 minutes, then gently stir. Pour batter into the prepared pan, spreading so it is as flat and even as possible.",
        "Place brownies in the preheated oven until they look dry and shiny on top and start to pull away from the edges of the pan, and until a toothpick inserted into the center comes out clean, about 25 minutes. Remove from the oven and let cool in the pan for at least 1 hour."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4896&h=2448&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6964831.jpg",
    "ingredients": [
        "cooking spray",
        "1 ½ cups granulated coconut sugar",
        "1 ¼ cups gluten-free oat flour",
        "½ cup Dutch-process cocoa",
        "½ cup cacao powder",
        "1 teaspoon baking powder",
        "1 ½ (10 ounce) bags vegan dark chocolate chips",
        "3 small organic zucchini, diced",
        "¾ cup grapeseed oil",
        "⅓ cup ground flaxseed meal",
        "1 teaspoon vanilla extract",
        "½ teaspoon pink Himalayan salt"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Chewy Vegan Zucchini Brownies",
    "url": "https://www.allrecipes.com/recipe/275513/chewy-vegan-zucchini-brownies/"
}