{
    "directions": [
        "Place cashews in a bowl and cover with water. Soak 4 hours to overnight. Drain and rinse cashews.",
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Drizzle 3 tablespoons oil in a baking dish and add pumpkin, cut-sides down. Pierce a few holes in the skin using a fork. Cover with aluminum foil.",
        "Bake in the preheated oven for 40 minutes. Add sage leaves to the baking dish with the pumpkin, replace aluminum foil, and bake until pumpkin is very tender, about 5 minutes more. Remove from oven and keep covered; let pumpkin and sage continue to steam 10 to 15 minutes more.",
        "Heat 2 tablespoons olive oil in a large skillet over medium heat. Add onion and garlic; cook and stir until golden brown, 3 to 5 minutes. Add tomato sauce, steamed sage leaves, dried basil, oregano, and salt. Cook and stir until incorporated, about 10 minutes. Scrape pumpkin flesh into skillet. Add coconut milk. Simmer 15 to 20 minutes more. Remove and discard sage leaves.",
        "Fill blender halfway with tomato mixture and add 1/2 the soaked cashews. Season generously with salt and pepper. Cover and hold lid down with a potholder; pulse a few times before leaving on to blend until smooth and creamy. Add remaining 4 tablespoons olive oil and blend again. Pour into a pot. Repeat with remaining tomato mixture. Adjust seasoning if necessary.",
        "Bring a large pot of lightly salted water to a boil. Add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain, reserving 1/2 cup pasta water. Return pasta to the pot.",
        "Stir 1/2 the sauce into the pot with the cooked pasta. Add more as needed to coat. Add reserved pasta water, 1/4 cup at a time, to thin sauce to desired creamy consistency. Add remaining sauce as desired. Top with fresh basil and serve hot."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1611&h=806&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5657221.jpg",
    "ingredients": [
        "1 ½ cups raw cashews",
        "9 teaspoons extra-virgin olive oil, divided",
        "1 small sugar pie pumpkin, halved and seeded",
        "5  fresh sage leaves",
        "1  yellow onion, chopped",
        "5 cloves garlic, minced",
        "½ cup unsweetened coconut milk",
        "1 cup tomato sauce",
        "1 teaspoon dried basil",
        "½ teaspoon oregano",
        "sea salt and ground black pepper to taste",
        "2 (16 ounce) packages penne pasta",
        "¼ cup fresh basil, or to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Creamy Vegan Pumpkin Penne Pasta",
    "url": "https://www.allrecipes.com/recipe/265579/creamy-vegan-pumpkin-penne-pasta/"
}