{
    "directions": [
        "Place potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 30 minutes. Drain.",
        "Let potatoes cool briefly, 5 to 10 minutes. Peel and place potatoes in a bowl and mash until smooth. Add flour and knead just until dough is smooth without overworking the potatoes. Season with salt. Cover bowl with a towel and let dough rest, about 10 minutes.",
        "Divide dough into 4 parts. Roll each into a long rope about 1 inch in diameter. Cut each rope into 1-inch-long pieces; press into the middle of each using your thumb or a fork to shape gnocchi.",
        "Bring a large pot of water to a boil. Add gnocchi; boil until they float to the top, 2 to 3 minutes. Transfer cooked gnocchi to a bowl or plate.",
        "Heat a nonstick saucepan over medium heat. Add garlic; cook until lightly browned and toasted, about 2 minutes. Add tomato puree and green onion; let simmer until slightly thickened, about 5 minutes. Add cherry tomatoes. sun-dried tomatoes, paprika, oregano, basil, 3/4 teaspoon salt, and pepper. Let sauce simmer until flavors blend, about 10 minutes more. Serve with gnocchi."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1000&h=500&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5026898.jpg",
    "ingredients": [
        "2 pounds potatoes",
        "3 cups whole wheat flour",
        "salt to taste",
        "2 cloves garlic, finely chopped",
        "2 (10.75 ounce) cans  tomato puree",
        "1  green onion, chopped",
        "4  cherry tomatoes",
        "2  sun-dried tomatoes",
        "1 teaspoon paprika",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "¾ teaspoon salt",
        "1 dash ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Delicious Vegan Gnocchi",
    "url": "https://www.allrecipes.com/recipe/262474/delicious-vegan-gnocchi/"
}