{
    "directions": [
        "Inspect dried beans, discarding any beans with impurities and any foreign objects. Put beans in a 7-quart multi-functional pressure cooker (such as Instant Pot®). Pour in water. Close and lock the lid. Select Bean function according to manufacturer's instructions; set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build.",
        "Allow natural release for 8 minutes. Manually release any remaining pressure, 5 to 10 minutes more. Unlock lid, drain liquid, and return drained beans back to pot. Add vegetable broth, 1 1/2 cups salsa, rice, and taco seasoning. Stir to combine.",
        "Cut the ear of corn into 5 pieces. Nestle each piece into the rice mixture, with some space between each. Close and lock the lid. Cook on Rice function for 22 minutes.",
        "Allow pressure to release naturally for 5 minutes. Manually release any remaining pressure, 5 to 10 minutes more. Fluff with a rice paddle.",
        "Divide lettuce between 5 bowls. Top with equal amounts of rice. Add equal amounts of avocado, vegan cheese, and cilantro. Serve with remaining salsa and lime wedges."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7641138.jpg",
    "ingredients": [
        "½ cup dried chickpeas",
        "½ cup dried black beans",
        "½ cup dried pinto beans",
        "½ cup dried kidney beans",
        "5 cups water",
        "2 cups reduced-sodium vegetable broth",
        "2 cups salsa, divided",
        "1 ½ cups uncooked brown rice",
        "1 tablespoon reduced-sodium taco seasoning mix",
        "1 ear corn, husked",
        "1 head iceberg lettuce, torn into bite-sized pieces",
        "1  avocado, cut into wedges",
        "1 cup shredded vegan Cheddar cheese",
        "5 tablespoons chopped fresh cilantro",
        "1  lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Instant Pot® Vegan Tex-Mex Bowls",
    "url": "https://www.allrecipes.com/recipe/278302/instant-pot-vegan-tex-mex-bowls/"
}