{
    "directions": [
        "Rinse jackfruit, dry, and set aside.",
        "Whisk together soda, vinegar, 1/8 cup vegetable oil, and lime juice in a large mixing bowl. Add onion, chili powder, panela, pepper, salt, and bay leaves. Add jackfruit pieces and mix to coat. Allow to marinate for at least 1 hour.",
        "Pour jackfruit and marinade into a nonstick skillet. Bring to a boil and simmer until the liquid has reduced by 3/4, about 20 minutes. Pour into a colander and drain; remove and discard bay leaves.",
        "Heat 1 tablespoon vegetable oil in the skillet over medium-high heat. Add drained jackfruit and cook, stirring with a wooden spoon to tear jackfruit into small pieces. Cook over medium-high heat, stirring constantly, until each piece is as crispy as possible, 10 to 15 minutes. Add remaining vegetable oil, if necessary.",
        "Meanwhile, heat the corn tortillas on a griddle. Ladle equal portions of jackfruit carnitas into each tortilla. Top with pickled jalapenos and carrots. Sprinkle with cilantro and garnish each taco with a lime wedge. Serve hot."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2878&h=1439&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6983147.jpg",
    "ingredients": [
        "1 (19 ounce) can young green jackfruit packed in water, drained",
        "1 (12 fluid ounce) can or bottle bitter orange soda",
        "⅛ cup vinegar",
        "¼ cup vegetable oil, divided",
        "1  lime, juiced",
        "1  onion, halved and thinly sliced",
        "1 tablespoon ground chili powder",
        "1 tablespoon grated panela",
        "1 teaspoon ground black pepper",
        "½ teaspoon salt",
        "2  bay leaves",
        "8  corn tortillas",
        "1 cup sliced Mexican pickled carrots and jalapenos",
        "½ cup chopped fresh cilantro",
        "1  lime, cut into 8 wedges"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Jackfruit Carnitas",
    "url": "https://www.allrecipes.com/recipe/275558/jackfruit-carnitas/"
}