{
    "directions": [
        "Place chickpeas into a large container and cover with several inches of cool water. Let soak 8 hours to overnight.",
        "Drain chickpeas and add to a medium-sized pot filled 3/4-full with water. Bring to a boil; reduce heat to medium and cook until soft, 30 to 40 minutes. Reserve 1 cup cooking water. Drain chickpeas and set aside.",
        "Combine coconut, green chiles, onion, ginger, and poppy seeds in a food processor. Break cilantro stalks in half and half again and add to the food processor. Pour in water and blend, adding more water as needed, until smooth.",
        "Place a large saucepan or pot over medium-high heat; add enough vegetable oil to cover the bottom and heat for 2 minutes. Reduce heat to low and add mustard seeds to temper, making sure not to stand over pot as popping of hot oil can cause mild burns.",
        "Add coconut mixture to pot once all mustard seeds have popped, followed by chickpeas, being careful that hot oil does not splash on you. Stir until puree is well-distributed with chickpeas. Add 1 cup reserved cooking water from chickpeas, salt, turmeric, black pepper, and jaggery.",
        "Reduce heat to medium-low and cook until curry begins to boil and froth slightly, 7 to 10 minutes. Remove from heat and serve."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "2 cups dry black chickpeas",
        "1 cup fresh coconut",
        "4  green chile peppers, stemmed, or more to taste",
        "1 large onion, chopped",
        "⅛ cup chopped fresh ginger",
        "1 teaspoon poppy seeds",
        "1 sprig cilantro, thick stems removed",
        "½ cup water, or more as needed",
        "1 tablespoon vegetable oil, or as needed",
        "1 teaspoon mustard seeds",
        "2 teaspoons salt, or to taste",
        "½ teaspoon ground turmeric",
        "½ teaspoon ground black pepper",
        "1 pinch jaggery  (Optional)"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Kadala Curry (Black Chickpea Stew)",
    "url": "https://www.allrecipes.com/recipe/273304/kadala-curry-black-chickpea-stew/"
}