{
    "directions": [
        "Soak apricots in a small bowl of water for 10 minutes and drain immediately. Soak cranberries in another small bowl for 20 minutes; drain immediately. Combine apricots and cranberries in a food processor and blend for 25 seconds. Transfer to a bowl.",
        "Place 1/2 cup walnuts in the food processor and blend. Return fruit to the food processor and process until a ball forms. Add remaining 1/4 cup walnuts and process until walnuts are broken into small but still visible pieces, about 20 seconds more. Transfer crust mixture to a bowl.",
        "Combine flax seed meal and hot water in a small bowl and let sit for 5 minutes.",
        "Combine flax mixture, coconut cream, water, lemon zest, vanilla extract, and stevia in a blender. Process until very smooth. Add additional coconut cream, 1 tablespoon at a time, if the mixture is not blending smoothly.",
        "Lightly spray 12 silicone mini muffin cups and place them on a baking sheet. Cut a 3-inch square of parchment paper. Place a scant tablespoon of crust mixture inside each cup and use the parchment paper square to push the crust down evenly. Repeat with remaining molds and crust mixture. Spoon filling into the cups to just below the top.",
        "Tap baking sheet with filled molds on the counter to release any air bubbles. Cover with plastic wrap and place in the freezer for at least 12 hours.",
        "Remove molds from freezer and immediately pop cheesecakes out onto a plate lined with parchment paper. Allow to defrost at least 10 minutes before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=750&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3338605.jpg",
    "ingredients": [
        "¼ cup chopped dried apricots",
        "¼ cup dried cranberries",
        "¾ cup chopped walnuts",
        "1 tablespoon flax seed meal",
        "2 ½ tablespoons hot water",
        "½ cup unsweetened coconut cream",
        "2 tablespoons water",
        "¾  lemon, zested",
        "¾ teaspoon vanilla extract",
        "¾ teaspoon stevia powder",
        "cooking spray"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Light Vegan Cheesecake Cups, Zero Sugar Added",
    "url": "https://www.allrecipes.com/recipe/264193/light-vegan-cheesecake-cups-zero-sugar-added/"
}