{
    "directions": [
        "Combine 4 cups water, lentils, eggplant, turmeric, and salt in a pressure cooker. Close cooker securely and place pressure regulator over vent according to manufacturer's instructions. Heat until steam escapes in a steady flow and makes a whistling sound, about 10 minutes. Adjust temperature until regulator is gently rocking. Cook for 3 minutes and remove from heat. Let pressure release naturally according to manufacturer's instructions, 5 to 10 minutes. Unlock lid and remove.",
        "Add remaining 2 1/2 cups water, tamarind paste, and chile powder to the pressure cooker. Close cooker securely and place pressure regulator over vent according to manufacturer's instructions. Heat until steam escapes in a steady flow and makes a whistling sound, about 10 minutes. Remove from heat. Let pressure release naturally according to manufacturer's instructions, 5 to 10 minutes. Unlock lid and remove.",
        "Combine oil, dried chile, curry leaves, cumin seeds, mustard seeds, and asafoetida powder in a small saucepan over low heat. Cook until spices begin to sputter a bit, about 1 minute. Transfer spice mixture to the pressure cooker with the lentils. Season with salt."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "6 ½ cups water, divided",
        "1 cup yellow lentils (tur daal)",
        "1 cup chopped eggplant",
        "1 teaspoon turmeric powder",
        "salt to taste",
        "1 tablespoon tamarind paste",
        "2 teaspoons ground red chile powder",
        "1 teaspoon vegetable oil, or as needed",
        "1  whole dried red chile",
        "4  curry leaves, or more to taste",
        "1 teaspoon whole cumin seeds",
        "1 teaspoon mustard seeds",
        "1 pinch asafoetida powder"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Pressure Cooker Sambar (Indian Lentil Curry)",
    "url": "https://www.allrecipes.com/recipe/266009/pressure-cooker-sambar-indian-lentil-curry/"
}