{
    "directions": [
        "Combine cooked cauliflower rice, roasted red peppers, lemon juice, tahini, garlic, cayenne, cumin, and sea salt in the bowl of a food processor. Pulse until mixture is an even color but still has texture, about 1 minute. Scrape down the sides once or twice during processing.",
        "Preheat the oven to 400 degrees F (200 degrees C). Line 2 baking sheets with aluminum foil and brush with avocado oil.",
        "Use a mandoline to carefully slice plantains into chips as thinly as possible. Place chips on the prepared baking sheets in a single layer.",
        "Lightly brush each chip with avocado oil and sprinkle with cayenne pepper, smoked paprika, and sea salt.",
        "Bake in the preheated oven on the convection setting until chips are browned and crisp, 10 to 12 minutes. If your oven does not have a convection setting, chips will need to cook longer, so watch carefully to avoid over-browning. Remove from baking sheet and drain on a paper-towel lined plate.",
        "Serve plantain chips with roasted red pepper-cauliflower hummus."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2258&h=1129&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6259455.jpg",
    "ingredients": [
        "2 cups cooked cauliflower rice",
        "4 ounces roasted red peppers, drained and chopped",
        "3 tablespoons lemon juice",
        "3 tablespoons tahini",
        "1 clove garlic, roughly chopped",
        "½ teaspoon cayenne pepper",
        "½ teaspoon cumin",
        "½ teaspoon sea salt",
        "2  green plantains",
        "2 tablespoons avocado oil, or as needed",
        "¼ teaspoon cayenne pepper",
        "¼ teaspoon smoked paprika",
        "sea salt to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Red Pepper-Cauliflower Hummus with Plantain Chips",
    "url": "https://www.allrecipes.com/recipe/270032/red-pepper-cauliflower-hummus-with-plantain-chips/"
}