{
    "directions": [
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Heat 1 tablespoon vegetable oil in a large skillet over medium-high heat. Add sweet potato and beet and fry until vegetables take on a little color, 3 to 5 minutes. Transfer to a large baking sheet with pumpkin.",
        "Roast vegetables on a low shelf in the preheated oven until soft, about 45 minutes.",
        "Meanwhile, place cauliflower florets in a saucepan, cover with water, and bring to a boil. Cook until soft but still firm, about 5 minutes. Remove from heat, run under cold water, and drain. Set aside.",
        "Heat remaining 1 tablespoon vegetable oil in a large skillet over medium-high heat. Add onion and fry until onion has softened and turned translucent, about 5 minutes. Add bell pepper and garlic and cook for another 2 minutes. Add curry powder, cumin, coriander, and turmeric; cook for 1 minute, stirring constantly to prevent burning. Add tomato puree and sugar and bring to a boil. Lower heat slightly, and simmer until sauce reduces, adding water as needed to maintain a thick consistency, about 20 minutes.",
        "Add reserved cauliflower and roasted vegetables to the reduced sauce, stirring carefully so vegetables maintain their shape. Heat until cauliflower is warm, 2 to 3 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1836&h=918&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6862145.jpg",
    "ingredients": [
        "2 tablespoons vegetable oil, divided",
        "1 cup chopped sweet potato",
        "1 cup chopped beet",
        "1 cup chopped peeled pumpkin",
        "½ head cauliflower, broken into florets",
        "1 small onion, chopped",
        "1  red bell pepper, chopped",
        "3 cloves garlic, chopped",
        "2 tablespoons mild curry powder",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon ground turmeric",
        "1 ½ cups tomato puree",
        "1 teaspoon white sugar",
        "water as needed"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Roasted Vegetable Curry with Pumpkin",
    "url": "https://www.allrecipes.com/recipe/275333/roasted-vegetable-curry-with-pumpkin/"
}