{
    "directions": [
        "Preheat the oven to 375 degrees F (190 degrees C). Line a large baking sheet with parchment paper; this will help later when putting the medley in a container.",
        "Combine pepitas, sunflower seeds, flax seeds, egusi, chia seeds, quinoa, white sesame seeds, black sesame seeds, and amaranth seeds in a large bowl. Mix together using a rubber spatula. Drizzle 1 tablespoon olive oil over seeds while mixing. Drizzle remaining olive oil in and continue mixing. Season with salt, cayenne, and ground peppercorns; mix until well combined. Pour mixture onto the prepared baking sheet and spread out in a single layer.",
        "Bake in the preheated oven for 10 minutes. Remove from oven and stir well. Bake for another 5 minutes and stir again. Check egusi seeds as they will be the first seeds that show signs of roasting by turning brown. Bake for 5 more minutes, checking in after 3 minutes without opening oven door. Once egusi are brown and pepitas are beginning to brown (they will have a glossy shine and should begin to puff up), turn off the heat and open the oven door. Leave the seeds inside with the door open for 10 minutes.",
        "Remove baking sheet and let seeds cool on the sheet, stirring occasionally. Once completely cooled, store in an airtight container for up to 3 weeks."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2412&h=1206&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4518364.jpg",
    "ingredients": [
        "1 cup pepitas",
        "1 cup raw sunflower seeds (hulled)",
        "½ cup flax seeds",
        "½ cup raw egusi (African watermelon seeds)",
        "¼ cup chia seeds",
        "¼ cup tri-colored quinoa, rinsed and dried",
        "¼ cup white sesame seeds",
        "⅛ cup black sesame seeds",
        "⅛ cup amaranth seeds",
        "2 tablespoons olive oil",
        "½ teaspoon fine sea salt",
        "½ teaspoon cayenne pepper",
        "¼ teaspoon freshly ground multicolored peppercorns"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Salad Crunchies Seed Medley",
    "url": "https://www.allrecipes.com/recipe/272537/salad-crunchies-seed-medley/"
}