{
    "directions": [
        "Combine water and flaxseed meal in a small bowl and stir together until well combined. Set aside and let flax \"egg\" thicken for 5 minutes.",
        "Combine beans, carrot, sun-dried tomatoes, and olive oil together in a food processor; puree until well combined. Transfer to a mixing bowl and add flax egg, beef substitute, parsley, herbes de Provence, garlic, onion, salt, and pepper. Mix everything together with your hands until thoroughly combined. Refrigerate \"meat\" mixture for 30 minutes.",
        "Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.",
        "Form mixture into 2-inch balls and set on the prepared baking sheet.",
        "Bake meatballs in the preheated oven for 14 minutes, turning over halfway through. Remove from the oven and let rest while you start on the marinara.",
        "Combine crushed tomatoes, tomato sauce, olive oil, balsamic vinegar, herbes de Provence, sugar, onion, garlic, and salt in a wide saucepan or skillet. Bring to a boil over medium-high heat. Add meatballs, reduce heat, and simmer over low heat for at least 30 minutes.",
        "Meanwhile, bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.",
        "Serve marinara sauce and meatballs over cooked spaghetti."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7733798.jpg",
    "ingredients": [
        "2 ½ tablespoons water",
        "1 tablespoon flaxseed meal",
        "½ (15 ounce) can cannellini beans, drained and rinsed",
        "1  medium carrot, shredded",
        "¼  finely chopped sun-dried tomatoes, packed in oil",
        "1 tablespoon olive oil",
        "1 ¼ pounds vegetarian ground beef substitute (such as Beyond Meat® Beyond Beef®)",
        "1 teaspoon dried parsley",
        "1 tablespoon herbes de Provence",
        "1 teaspoon granulated garlic",
        "1 teaspoon granulated onion",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1 (28 ounce) can crushed tomatoes",
        "1 (15 ounce) jar tomato sauce",
        "2 tablespoons olive oil",
        "2 tablespoons balsamic vinegar",
        "1 tablespoon herbes de Provence",
        "2 teaspoons white sugar, or more to taste",
        "½ teaspoon granulated onion",
        "½ teaspoon granulated garlic",
        "1 teaspoon salt",
        "1 (16 ounce) package spaghetti"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Spaghetti and Meatless Meatballs",
    "url": "https://www.allrecipes.com/recipe/278797/spaghetti-and-meatless-meatballs/"
}