{
    "directions": [
        "Mix water, soy sauce, nutritional yeast, maple syrup, lemon juice, sage, and bacon salt together to make the marinade. Place tempeh in marinade; refrigerate for 1 hour to overnight.",
        "Preheat the oven to 375 degrees F (190 degrees C). Line two baking sheets with parchment paper.",
        "Sprinkle squash with salt and pepper. Place squash cut-side down on a baking sheet; spread pecans over the other.",
        "Bake pecans in the preheated oven until browned, 8 to 10 minutes. Bake squash until tender, 30 to 40 minutes.",
        "Meanwhile, heat 1 tablespoon vegan butter in a large skillet over medium heat. Add onion and cook until translucent, about 5 minutes. Add the tempeh and marinade, kale, mushrooms, garlic, fennel seeds, oregano, rosemary, thyme, and red pepper flakes. Increase heat to medium-high. Cook until water has evaporated and tempeh and kale are crispy and browned, about 7 minutes. Season with salt and pepper and more bacon salt if needed.",
        "Dollop remaining vegan butter into each cooked squash half. Stuff with the tempeh mixture and top with pecans."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "¼ cup water",
        "3 tablespoons soy sauce",
        "1 tablespoon nutritional yeast",
        "2 teaspoons maple syrup",
        "1 ½ teaspoons lemon juice",
        "1 teaspoon dried sage",
        "½ teaspoon hickory bacon-flavored salt, or more taste",
        "1 (8 ounce) package tempeh, cut into 1/4-inch pieces",
        "3 medium acorn squash, halved and seeded",
        "salt and ground black pepper to taste",
        "⅓ cup pecans, or to taste, finely chopped",
        "2 tablespoons vegan butter (such as Earth Balance®), divided",
        "1 medium onion, diced",
        "3 cups chopped kale",
        "1 cup mushrooms, diced  (Optional)",
        "3 cloves garlic, minced",
        "1 tablespoon fennel seeds",
        "1 teaspoon dried oregano",
        "¾ teaspoon dried rosemary",
        "¾ teaspoon dried thyme",
        "½ teaspoon red pepper flakes"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Tempeh Sausage-Stuffed Acorn Squash",
    "url": "https://www.allrecipes.com/recipe/265582/tempeh-sausage-stuffed-acorn-squash/"
}