{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Cook macaroni in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain.",
        "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain. Peel and finely chop potatoes when cool enough to handle.",
        "Combine potatoes, onion, carrot, and garlic in a small pot over medium heat. Add 2 tablespoons water and cook until soft enough to blend and water is mostly evaporated, about 3 minutes. Remove from heat. Transfer sauce to a blender. Add 3/4 cup water, cashews, soy milk, nutritional yeast, lemon juice, salt, paprika, and cayenne. Cover the blender and hold lid down with a potholder; pulse a few times before leaving on to blend until smooth.",
        "Heat 2 tablespoons water in a nonstick pan over medium heat. Add broccoli and cook until soft but still a little crunchy, about 5 minutes. Transfer to a large serving bowl. Pour sauce in and mix until thoroughly coated."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1000&h=500&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5026896.jpg",
    "ingredients": [
        "1 ¾ cups whole wheat elbow macaroni",
        "2  potatoes",
        "1 small onion, chopped",
        "½  carrot, finely chopped",
        "1  clove garlic, minced",
        "2 tablespoons water, or as needed",
        "¾ cup water",
        "½ cup cashews",
        "¼ cup soy milk",
        "¼ cup nutritional yeast",
        "1 tablespoon lemon juice",
        "1 teaspoon sea salt",
        "1 dash ground paprika",
        "1 dash cayenne pepper",
        "2 tablespoons water",
        "2 cups chopped broccoli florets"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "The Best Vegan Mac and Cheese",
    "url": "https://www.allrecipes.com/recipe/262475/the-best-vegan-mac-and-cheese/"
}