{
    "directions": [
        "Line a medium sized, round colander with a cheese cloth or a clean dish towel. Place the crumbled tofu in the colander. Place another cheese cloth over the top of the tofu. Place the colander over the top of a bowl to catch the liquid. Place a heavy weight on top of tofu. Refrigerate the colander, tofu and weight for 2 to 3 hours.",
        "Make the stuffing: In a large frying pan saute onion, celery and mushrooms in 2 tablespoons of the sesame oil until tender. Add the garlic, sage, thyme, salt and pepper, rosemary and 1/4 cup of the tamari. Stir well; cook for 5 minutes. Add prepared herb stuffing and mix well. Remove from heat.",
        "Preheat the oven to 400 degrees F (200 degrees C). Grease a cookie sheet.",
        "Combine 1/2 cup sesame oil, 1/4 cup tamari, miso, orange juice, mustard and orange zest in a small bowl; mix well.",
        "Remove the weight from the tofu. Hollow out the tofu so that there is one inch of tofu still lining the colander. Place the scooped out tofu in a separate bowl. Brush the tofu lining with a small amount of the miso seasoning. Scoop the stuffing into the center of the tofu shell. Place the leftover tofu on top of the stuffing and press down firmly. Turn the stuffed tofu onto the prepared cookie sheet. Putting the leftover tofu side of the \"turkey\" (the flat side) down. Gently press on the sides of the \"turkey\" to form a more oval shape.  Brush the tofu turkey with 1/2 of the oil-tamari mixture. Place the sprigs of rosemary on top of the tofu. Cover the \"turkey\" with foil.",
        "Bake for one hour. After one hour, remove \"turkey\" from the oven and remove the foil. Baste the \"turkey\" with the remaining tamari-oil sauce (reserving 4 tablespoons of sauce). Return \"turkey\" to oven and bake another hour or until the tofu turkey is golden brown.  Place the tofu turkey on a serving platter, brush with the remaining tamari-oil mixture and serve hot."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=960&h=480&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F08%2F5971858.jpg",
    "ingredients": [
        "5 (16 ounce) packages extra-firm tofu",
        "2 tablespoons sesame oil",
        "1  red onion, finely diced",
        "1 ⅓ cups diced celery",
        "1 cup chopped mushrooms",
        "2 cloves garlic, minced",
        "⅛ cup dried sage",
        "2 teaspoons dried thyme",
        "salt and pepper to taste",
        "1 ½ teaspoons dried rosemary",
        "¼ cup tamari",
        "3 cups prepared herb stuffing",
        "½ cup sesame oil",
        "¼ cup tamari",
        "2 tablespoons miso paste",
        "5 tablespoons orange juice",
        "1 teaspoon honey mustard",
        "½ teaspoon orange zest",
        "3 sprigs fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Tofu Turkey I",
    "url": "https://www.allrecipes.com/recipe/14113/tofu-turkey-i/"
}