{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease 3 8-inch cake pans and line with parchment paper.",
        "Combine flour, sugar, baking powder, and baking soda in a large bowl. Whisk together water, oil, and vanilla extract in a second bowl. Make a well in the center of the flour mixture and pour in water-mixture. Mix well with a wooden spoon until batter is well combined, 3 to 5 minutes.",
        "Divide cake batter evenly into prepared cake pans. Rest for 15 minutes.",
        "Bake in the preheated oven until a toothpick inserted in the middle comes out clean, about 45 minutes. Carefully remove from oven. Cool for 5 minutes in pans and turn out onto wire racks. Cool completely before filling and decorating.",
        "Pour coconut cream in a mixing bowl and chill in freezer for 5 minutes. Remove from freezer and whisk in vanilla extract. Whisk in sugar gradually until stiff peaks form. Spoon coconut cream into a piping bag with a large tip.",
        "Place one of the cakes on a serving plate. Pipe about half of the cream in concentric circles to cover the top of the cake. Arrange half of the peaches on this first layer. Add the second cake layer and repeat, using up the rest of the cream and the peaches. Lightly dust the top of the cake with confectioners' sugar and serve."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3264&h=1632&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4543681.jpg",
    "ingredients": [
        "2 ¾ cups gluten-free all purpose baking flour",
        "1 ¼ cups white sugar",
        "1 teaspoon baking soda",
        "1 teaspoon gluten-free baking powder",
        "1 cup cold water",
        "⅓ cup vegetable oil",
        "1 teaspoon vanilla extract",
        "1 (14 ounce) can cream of coconut",
        "2 teaspoons vanilla extract",
        "2 tablespoons white sugar",
        "1 (15 ounce) can canned peaches in syrup, drained and cubed",
        "2 tablespoons confectioners' sugar, or to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan and Gluten-Free Naked Cake with Peaches and Coconut Cream",
    "url": "https://www.allrecipes.com/recipe/259253/vegan-and-gluten-free-naked-cake-with-peaches-and-coconut-cream/"
}