{
    "directions": [
        "Preheat the oven to 355 degrees F (180 degrees C). Grease an 8x8-inch baking pan with 1 teaspoon olive oil.",
        "Combine vegetable broth and 1 cup water in a large pot and bring to a boil over high heat. Reduce heat to medium and keep at a low boil. Pour in unsweetened oat milk and bring to a boil. Sprinkle in cornmeal, whisking constantly to avoid clumps from forming. Reduce heat to medium-low and continue stirring until polenta begins to thicken. Add more water if needed. Stir until polenta has softened and thickened, about 20 minutes.",
        "Meanwhile, heat remaining 2 teaspoons olive oil in a skillet. Add onion and carrot. Saute until vegetables have just begun to soften. Add radicchio and saute until wilted. Season with pepper and turmeric. Cook until vegetables are tender and cooked throughout, about 5 minutes.",
        "Spread out 1/2 of the polenta in the greased baking dish. Evenly layer 1/2 of the vegan Gouda and 1/2 of the vegan mozzarella on top. Top with 1/2 of the radicchio mixture. Repeat layers with remaining polenta, cheeses, and radicchio mixture.",
        "Bake in the preheated oven until cheese has melted and is bubbling, about 20 minutes. Allow to rest for 5 minutes before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7675867.jpg",
    "ingredients": [
        "3 teaspoons olive oil, divided",
        "1 ½ cups vegetable broth",
        "1 ½ cups water, divided",
        "¾ cup unsweetened oat milk",
        "1 ½ cups medium grind, whole-grain cornmeal (such as Bob's Red Mill®)",
        "½ cup sliced yellow onion",
        "½ cup shredded carrot",
        "1 medium head radicchio, cored and thinly sliced",
        "½ teaspoon coarse ground black pepper",
        "½ teaspoon ground turmeric",
        "3 (1 ounce) slices vegan smoked Gouda",
        "3 ½ ounces vegan shredded mozzarella"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Baked Polenta with Radicchio",
    "url": "https://www.allrecipes.com/recipe/278721/vegan-baked-polenta-with-radicchio/"
}