{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan and line with parchment paper.",
        "Combine teff flour, rice flour, arrowroot, sugar, coffee, baking soda, and salt in a large bowl.",
        "Place chocolate and 2 tablespoons soy milk in top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Add 2 cups soy milk and stir until well combined. Add vinegar.",
        "Pour the chocolate mixture over the flour mixture and mix with a spatula until batter is well combined. Pour into the springform pan and level with a spatula.",
        "Bake in the preheated oven until set but still slightly soft, about 35 minutes. Allow to cool for a few minutes in the pan, then remove and cool completely on a wire rack, about 45 minutes.",
        "Make the glaze while the cake is cooling. Place chocolate and coconut oil in top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Pour melted chocolate over cake and spread evenly. Allow to set before slicing."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2048&h=1024&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5284320.jpg",
    "ingredients": [
        "1 ½ cups teff flour",
        "7 tablespoons rice flour",
        "5 tablespoons arrowroot starch",
        "2 ½ tablespoons brown sugar",
        "2 teaspoons instant coffee granules",
        "1 teaspoon baking soda",
        "1 pinch salt",
        "9 ounces dark chocolate, chopped",
        "2 tablespoons soy milk",
        "2 cups soy milk",
        "1 tablespoon cider vinegar",
        "2 ounces dark chocolate, chopped, divided",
        "1 teaspoon coconut oil  (Optional)"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan and Gluten-Free Chocolate Cake",
    "url": "https://www.allrecipes.com/recipe/263461/vegan-and-gluten-free-chocolate-cake/"
}