{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Combine broccoli, red bell peppers, and yellow onion in a large bowl. Add olive oil, juice of 2 limes, and 1/2 teaspoon salt; toss to coat. Spread vegetables onto a baking sheet.",
        "Roast vegetables, stirring 1 or 2 times, in the preheated oven until edges begin to blacken, about 30 minutes. Remove from oven and cool slightly.",
        "Fill a large pot with water and 1/2 teaspoon salt; bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.",
        "Blend avocados, juice of 2 limes, garlic, and 1/2 teaspoon salt in a food processor or blender until sauce is smooth, scraping down sides as needed. Add 1/2 cup chopped cilantro and pulse until just incorporated.",
        "Gently toss pasta, roasted vegetables, and sauce together in a large bowl. Garnish with cherry tomatoes, cilantro stems, sea salt, and black pepper."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=750&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4524916.jpg",
    "ingredients": [
        "2 heads broccoli, cut into 1-inch florets",
        "2  red bell peppers, cut into 1/2-inch chunks",
        "1  yellow onion, thinly sliced into rings, rings separated",
        "3 tablespoons olive oil",
        "2  limes, juiced",
        "½ teaspoon salt",
        "½ teaspoon salt",
        "2 pounds penne pasta",
        "4  avocados - peeled, pitted, and chopped",
        "2  limes, juiced",
        "3 cloves garlic, peeled",
        "½ teaspoon salt, or more to taste",
        "½ cup chopped fresh cilantro  (Optional)",
        "1 cup cherry tomatoes, halved  (Optional)",
        "4  fresh cilantro stems, or to taste  (Optional)",
        "1 pinch sea salt to taste  (Optional)",
        "freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Avocado Pasta with Blackened Vegetables",
    "url": "https://www.allrecipes.com/recipe/236448/vegan-avocado-pasta-with-blackened-vegetables/"
}