{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
        "Warm Worcestershire sauce, tamari, water, mushroom, black bean paste, shallot, garlic clove, and seaweed in a saucepan over medium heat. Remove from heat and let cool. Drain sauce and discard the solids.",
        "Place tempeh in a bowl and pour 1/3 cup of the sauce on top. Marinate for 20 minutes, turning tempeh over halfway.",
        "Remove 1 teaspoon of the tempeh marinade and whisk together with vegan mayo and sriracha in a separate bowl. Refrigerate until needed.",
        "Arrange baguette pieces on the prepared baking sheet and drizzle olive oil on top. Toss and arrange bread into a single layer.",
        "Bake in the preheated oven for 15 minutes. Turn bread and cook until browned, about 8 minutes more. Transfer to a bowl.",
        "Place the tempeh on the baking sheet; reserve the liquid. Bake for 10 minutes, basting with some of the reserved marinade halfway through. Flip tempeh; bake, basting again, for 10 minutes more.",
        "Cut tempeh into cubes. Arrange the bread, tempeh, jalapeno slices, pickled daikon, carrot, cucumber, and cilantro into serving bowls. Top with sriracha mayo."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2840&h=1420&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5911032.jpg",
    "ingredients": [
        "½ cup vegan Worcestershire sauce",
        "½ cup tamari soy sauce",
        "½ cup water",
        "1  shiitake mushroom",
        "1 tablespoon fermented black bean paste",
        "1 tablespoon minced shallot",
        "1 clove garlic, crushed",
        "1 strip nori seaweed",
        "4 ½ ounces tempeh",
        "¼ cup vegan mayonnaise",
        "1 teaspoon sriracha sauce",
        "1 (6 inch) French baguette, sliced into bite-sized cubes",
        "1 tablespoon olive oil",
        "1  jalapeno pepper, sliced",
        "½ ounce pickled daikon, or to taste",
        "½ ounce pickled carrot, or to taste",
        "2  cucumber slices, or to taste",
        "3 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Banh Mi",
    "url": "https://www.allrecipes.com/recipe/268914/vegan-banh-mi/"
}