{
    "directions": [
        "Let pizza dough sit out until it comes to room temperature, about 20 minutes.",
        "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
        "Stretch pizza dough to desired shape and place on the prepared baking sheet. Brush dough with a thin coat of olive oil.",
        "Bake dough in the preheated oven until it is cooked all the way through and the edges are lightly browned, 20 to 25 minutes.",
        "While the dough is cooking, heat a large skillet over medium heat. Add remaining oil. When oil is hot, add shallot and garlic and cool until they start to turn translucent, 1 to 2 minutes. Add mushrooms and cook until browned, 5 to 7 minutes. Stir in artichoke antipasto and cook until heated through, 2 to 3 minutes. Season with salt and pepper and remove from heat.",
        "Remove dough from the oven; brush lightly with truffle oil. Spread mushroom-artichoke mixture on top, sprinkle with arugula, drizzle gently with balsamic glaze, and top with lemon zest. Cut and serve."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1280&h=640&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6924686.jpg",
    "ingredients": [
        "1 (16 ounce) package pre-made pizza dough",
        "1 tablespoon olive oil, divided",
        "½ large shallot, diced",
        "2 cloves garlic, thinly sliced",
        "1 (8 ounce) package baby portobello mushrooms, sliced",
        "¼ (12 ounce) jar artichoke antipasto (such as Trader Joe's®)",
        "salt and ground black pepper to taste",
        "½ tablespoon truffle oil",
        "½ cup arugula",
        "1 tablespoon balsamic vinegar glaze (such as Trader Joe's®)",
        "1 teaspoon lemon zest, or to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Artichoke and Mushroom Flatbread",
    "url": "https://www.allrecipes.com/recipe/275237/vegan-artichoke-and-mushroom-flatbread/"
}