{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Place butternut squash in a baking dish.",
        "Bake in the preheated oven until softened and easy to cut into, 35 to 40 minutes.",
        "Allow squash to cool until safe to handle. Peel, seed, and cut squash into chunks and place in a bowl.",
        "Heat oil in a large pot over medium heat. Add carrots and cook for 3 minutes. Mix in onion and celery; cook until browned and soft, 3 to 5 minutes more. Add tomato sauce, 1 1/2 teaspoons dried basil, and salt; cook until slightly thickened, 5 to 10 minutes.",
        "Add baked butternut squash to the pot with the tomato sauce. Mix well. Add coconut milk and fresh basil. Reduce heat, cover, and simmer 20 minutes, stirring soup occasionally.",
        "Preheat the oven to 325 degrees F (165 degrees C).",
        "Cut baguette in half diagonally. Drizzle with olive oil and sprinkle with remaining 2 teaspoons dried basil. Place on a baking sheet.",
        "Bake baguette in the preheated oven until golden brown, about 10 minutes.",
        "Fill blender halfway with soup. Cover and hold lid down with a potholder; pulse a few times before leaving on to blend. Pour into a pot. Repeat with remaining soup. Return blended soup to the pot over medium heat; cook until warmed through, about 5 minutes. Adjust seasonings. Serve with warm baguette."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1688&h=844&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5645353.jpg",
    "ingredients": [
        "2  butternut squash",
        "4 tablespoons olive oil",
        "1  carrot, peeled and finely chopped",
        "1 cup finely chopped onion",
        "½ cup celery, finely chopped",
        "1 cup tomato sauce",
        "3 ½ teaspoons dried basil, divided",
        "1 teaspoon salt",
        "3 cups coconut milk",
        "2 tablespoons chopped fresh basil",
        "1  French baguette",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Butternut Squash Soup with Coconut Milk",
    "url": "https://www.allrecipes.com/recipe/265523/vegan-butternut-squash-soup-with-coconut-milk/"
}