{
    "directions": [
        "Combine broth, water, and bay leaf in a small saucepan; bring to a boil. Add quinoa. Reduce heat to low; cover and simmer until liquid is absorbed, 12 to 15 minutes. Discard bay leaf. Stir in tomato paste, parsley, salt, paprika, oregano, basil, and thyme.",
        "Preheat the oven to 350 degrees F (175 degrees C). Coat a 10x15-inch baking pan with cooking spray.",
        "Cut a thin slice from the bottom of each green bell pepper so it stands upright, if necessary. Fill a 4-quart Dutch oven with enough water to cover the peppers and bring to a boil. Add peppers and cook until tender but firm, about 2 minutes. Drain and rinse with cold water.",
        "Heat olive oil in a large nonstick skillet over medium-high heat. Add carrots, onion, celery, and garlic; saute until tender, about 6 minutes. Add the cooked quinoa; cook and stir until heated through, about 2 minutes. Remove from heat and add mushrooms. Spoon mixture into peppers and place into the prepared pan.",
        "Bake, uncovered, in the preheated oven until peppers are tender, 20 to 25 minutes."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "1 (14.5 ounce) can vegetable broth",
        "¼ cup water  (Optional)",
        "1  bay leaf",
        "1 cup quinoa, rinsed",
        "1 (6 ounce) can tomato paste  (Optional)",
        "1 teaspoon dried parsley",
        "½ teaspoon salt  (Optional)",
        "½ teaspoon paprika",
        "½ teaspoon dried oregano",
        "½ teaspoon dried basil",
        "¼ teaspoon dried thyme",
        "cooking spray",
        "4 large green bell peppers - tops, seeds, and membranes removed",
        "water to cover  (Optional)",
        "1 tablespoon olive oil",
        "4  carrots, finely chopped",
        "1  onion, finely chopped",
        "2 stalks celery, finely chopped",
        "2 cloves garlic, chopped",
        "2 large white mushrooms, sliced"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Quinoa-Stuffed Peppers",
    "url": "https://www.allrecipes.com/recipe/261727/vegan-quinoa-stuffed-peppers/"
}