{
    "directions": [
        "Spread cubed bread on a baking sheet. Cover with a paper towel and let sit at room temperature until slightly stale, at least 8 hours to overnight.",
        "Preheat the oven to 300 degrees F (150 degrees C).",
        "Toss stale bread cubes with olive oil and sprinkle with thyme, rosemary, oregano, parsley, garlic salt, and white pepper. Spread evenly on the baking pan.",
        "Bake in the preheated oven for 20 minutes. Stir and continue baking until crispy, about 20 minutes more, checking frequently. Remove from the oven and set homemade croutons aside.",
        "Increase oven temperature to 350 degrees F (175 degrees C). Grease a large baking pan.",
        "Heat margarine in a large pan over medium heat. Add celery, onion, mushrooms, and garlic. Cook and stir until soft, about 5 minutes. Add broth and white pepper and simmer for 3 minutes more. Add homemade croutons and stir, transferring mixture to a large bowl if necessary. Pour stuffing mixture into the prepared baking pan.",
        "Bake in the hot oven, uncovered, for about 40 minutes."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "1  crusty baguette, cut into 1/2-inch cubes",
        "1 tablespoon olive oil, or as needed",
        "1 tablespoon ground thyme",
        "1 tablespoon dried rosemary",
        "1 tablespoon dried oregano",
        "1 tablespoon dried parsley",
        "1 teaspoon garlic salt, or more to taste",
        "1 teaspoon ground white pepper",
        "½ cup vegan margarine",
        "1 cup chopped celery",
        "1 cup chopped onion",
        "1 cup chopped fresh mushrooms",
        "3 cloves garlic, chopped, or more to taste",
        "1 (32 fluid ounce) container vegetable broth",
        "½ teaspoon ground white pepper"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Mushroom Thanksgiving Stuffing",
    "url": "https://www.allrecipes.com/recipe/274667/vegan-mushroom-thanksgiving-stuffing/"
}