{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Drop cabbage into the pot and fully submerge in the water. Cook for 10 minutes. Remove from water and allow to cool enough to handle, about 10 minutes. Pull leaves off carefully.",
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Heat 1 tablespoon oil in a large skillet over medium-high heat. Add onion, 1/3 of the thyme, and garlic. Cook until onions are translucent, about 5 minutes. Add mushrooms, raisins, and cinnamon and cook for about 3 minutes. Stir in walnuts and season with 1/3 of the sea salt. Transfer mixture to a large bowl and add rice; stir stuffing into a uniform mixture.",
        "Grease a baking dish with remaining olive oil and line the bottom with a thin layer of tomatoes. Sprinkle lightly with 1/3 of the thyme, 1/3 of the sea salt, and pepper to taste.",
        "Scoop about a heaping tablespoon of stuffing into a cabbage leaf and fold in the sides first, then roll and place in the prepared pan. Repeat with remaining leaves and stuffing. Use any torn leaves to close up any broken rolls. Top with remaining tomatoes and remaining thyme. Season with remaining salt and pepper.",
        "Cover the baking dish with aluminum foil or a cover.",
        "Bake in the preheated oven until tender, about 45 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7150999.jpg",
    "ingredients": [
        "1 large head cabbage, cored",
        "2 tablespoons olive oil, divided",
        "1 medium onion, minced",
        "¼ cup fresh thyme leaves, divided",
        "3 cloves garlic, chopped",
        "¾ pound mushrooms, finely chopped",
        "½ cup raisins",
        "1 teaspoon ground cinnamon",
        "¾ cup walnuts, roughly chopped",
        "1 teaspoon sea salt, or to taste, divided",
        "½ cup uncooked brown rice",
        "1 (16 ounce) can crushed tomatoes, divided",
        "ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Mushroom-Stuffed Cabbage Rolls",
    "url": "https://www.allrecipes.com/recipe/276516/vegan-mushroom-stuffed-cabbage-rolls/"
}