{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Heat 1 tablespoon olive oil in a skillet over medium heat. Stir in garlic and cook until lightly browned, 2 to 3 minutes. Place in a bowl. Add stewed tomatoes, diced tomatoes, tomato sauce, and dried basil. Mix until thoroughly combined.",
        "Combine carrots and zucchini in a separate bowl. Mix olives and mushrooms together in another bowl.",
        "Heat remaining 2 tablespoons olive oil in the skillet over medium heat. Add eggplant slices and cook until browned, 2 to 3 minutes per side. Remove from heat.",
        "Layer 1/3 tomato sauce mixture, eggplant, 1/4 cup coconut flour sprinkled over eggplant, spinach, olive and mushroom mixture, and carrot and zucchini mixture into a 15x10-inch pan. Sprinkle remaining 1/4 cup coconut flour over carrot and zucchini layer. Top with remaining tomato sauce, smoothing and spreading flat. Cover with aluminum foil.",
        "Bake in the preheated oven until vegetables are becoming tender, about 45 minutes. Remove from oven, uncover, and continue baking until completely tender, about 30 minutes more."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "3 tablespoons olive oil, or as needed, divided",
        "3 cloves garlic, chopped, or more to taste",
        "1 (15 ounce) can stewed tomatoes, drained",
        "1 (15 ounce) can diced tomatoes, drained",
        "1 (15 ounce) can tomato sauce",
        "2 teaspoons dried basil",
        "2  carrots, shredded",
        "1 medium zucchini, shredded",
        "1 (15 ounce) can black olives, drained and sliced",
        "1 (8 ounce) can mushrooms, drained and chopped",
        "2 medium eggplant, sliced into 1/4-inch-thick rounds",
        "½ cup coconut flour",
        "1 (5 ounce) package baby spinach leaves"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Vegetable Lasagna",
    "url": "https://www.allrecipes.com/recipe/272942/vegan-vegetable-lasagna/"
}