{
    "directions": [
        "Combine tomatoes, onions, garlic, peppercorns, dried peppers, ginger, cloves, cinnamon, and salt together in a food processor. Grind to a fine paste and transfer to a bowl.",
        "Place rice in a bowl with water to cover. Soak for 15 minutes. Bring 2 cups water to a boil in a saucepan and add drained rice and 1 pinch of salt. Cook until rice is starting to soften but still firm to the bite, about 10 minutes. Drain and transfer to a bowl. Mix in fried onions, cilantro, and salt to taste.",
        "Bring 1 cup water and 1 pinch salt to a boil in a saucepan. Add potatoes, cauliflower, green beans, and peas. Cook until vegetables are just starting to become tender, 3 to 5 minutes. Drain.",
        "Heat oil in a pan over medium heat. Add 1 tablespoon mixed masala paste and fry for 1 minute. Add partially cooked vegetables and 1 pinch of salt; stir gently. Add cumin, coriander, and 1/2 teaspoon of the masala paste. Mix well and add a splash of water. Cook for 5 minutes. Cover and cook until vegetables are tender, about 3 minutes more.",
        "Spread partially cooked rice evenly and loosely over the vegetables in the pan, leaving small gaps for steam to escape. Cover and cook until rice is tender, about 10 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2457&h=1229&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6352008.jpg",
    "ingredients": [
        "2  tomatoes, chopped",
        "2  onions, chopped",
        "15 cloves garlic, minced",
        "4  whole black peppercorns",
        "4  dried red chile peppers",
        "½ inch piece ginger",
        "2  whole cloves",
        "1 (1/2 inch) piece cinnamon stick",
        "salt to taste",
        "1 ½ cups basmati rice",
        "2 cups water",
        "1 cup French-fried onions",
        "1 cup finely chopped fresh cilantro",
        "1 cup water",
        "¼ cup chopped potatoes",
        "¼ cup chopped cauliflower",
        "¼ cup chopped French-style green beans",
        "¼ cup peas",
        "4 tablespoons vegetable oil",
        "½ teaspoon ground cumin",
        "½ teaspoon ground coriander"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Biryani",
    "url": "https://www.allrecipes.com/recipe/263640/vegan-biryani-recipe/"
}