{
    "directions": [
        "Place guajillo peppers in a saucepan, cover with water, and boil until softened, about 10 minutes. Drain.",
        "Combine lime juice, 2 cloves garlic, cumin, and cloves in a small saucepan over medium heat; bring to a boil. Remove from heat and cool for 5 minutes. Pour into a blender, add guajillo peppers, and blend until smooth. Add 1 to 2 tablespoons of the water if the sauce is too thick.",
        "Heat oil in a large saucepan over medium heat and cook onion slices until soft and translucent, about 5 minutes. Stir in vegetable protein; cook and stir for 2 minutes. Pour in guajillo sauce and remaining water; season with salt. Bring to a boil; reduce heat to medium-low cook, covered, until flavors combine, about 10 minutes.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Combine tomatoes and chile de arbol peppers in a baking dish.",
        "Roast tomatoes and peppers until charred, 5 to 10 minutes. Cool tomatoes slightly. Peel.",
        "Combine peeled tomatoes, peppers, 1 slice onion, 1 clove garlic, and salt in a blender; blend until smooth. Pour salsa into a small bowl.",
        "Warm corn tortillas in a skillet. Divide vegetable protein mixture amongst tortillas and top with salsa, chopped onion, and cilantro."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=960&h=480&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4558091.jpg",
    "ingredients": [
        "5  guajillo chile peppers, stemmed and seeded",
        "5  limes, juiced",
        "2 cloves garlic",
        "2 pinches ground cumin",
        "3  whole cloves",
        "2 cups water, divided",
        "2 tablespoons vegetable oil",
        "½  onion, halved and cut into thin slices",
        "1 ½ (12 ounce) packages textured vegetable protein",
        "4  tomatoes",
        "4  dried chile de arbol peppers, stemmed",
        "1 slice onion",
        "1 clove garlic",
        "salt to taste",
        "1 (32 ounce) package corn tortillas",
        "1 large onion, chopped",
        "1 bunch cilantro, finely chopped"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Tacos al Pastor",
    "url": "https://www.allrecipes.com/recipe/260305/vegan-tacos-al-pastor/"
}