{
    "directions": [
        "Preheat the oven to 425 degrees F (220 degrees C). Grease a jumbo 6-cup muffin tin and 1/2 of a standard muffin tin with cooking spray.",
        "Mix almond milk and vinegar together. Set aside until milk appears curdled, about 5 minutes.",
        "Mix flour, baking powder, baking soda, pumpkin pie spice, and salt together in a large bowl.",
        "Whisk almond milk mixture, pumpkin puree, maple syrup, applesauce, and vanilla extract together in a separate bowl. Fold in flour mixture using a rubber spatula until batter is just combined. Do not overmix.",
        "Fill each jumbo muffin cup with 1/2 cup batter. Fill each standard muffin cup with 1/4 cup batter.",
        "Mix oats, flour, cinnamon, and salt together to make streusel topping. Rub in coconut oil until large clumps form. Fold in pecans. Sprinkle 2 tablespoons of the streusel over the jumbo muffins. Top standard-sized muffins with 1 tablespoon streusel.",
        "Bake muffins in the preheated oven for 5 minutes. Reduce oven temperature to 375 degrees F (190 degrees C). Bake standard-sized muffins for 5 to 8 minutes more. Bake jumbo muffins for 10 to 15 minutes more.",
        "Let cool for a few minutes before removing from the tins."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3024&h=1512&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5525680.jpg",
    "ingredients": [
        "cooking spray",
        "½ cup almond milk, at room temperature",
        "2 tablespoons distilled white vinegar",
        "2 ½ cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon baking soda",
        "1 ½ teaspoons pumpkin pie spice",
        "½ teaspoon salt",
        "1 (15 ounce) can pumpkin puree",
        "½ cup maple syrup",
        "½ cup unsweetened applesauce",
        "1 tablespoon vanilla extract",
        "⅓ cup rolled oats",
        "2 tablespoons all-purpose flour",
        "½ teaspoon ground cinnamon",
        "¼ teaspoon salt",
        "¼ cup coconut oil, melted and slightly cooled",
        "½ cup pecan pieces, chopped"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Pumpkin Muffins",
    "url": "https://www.allrecipes.com/recipe/266395/vegan-pumpkin-muffins/"
}