{
    "directions": [
        "Process black beans in a food processor or blender with just enough of the reserved can liquid to get the processor going. Place into a large bowl.",
        "Blend oats in the food processor until they become oat flour; add to the large bowl. Blend sunflower seeds until finely ground; add to the bowl. Blend mushrooms, bell peppers, and onion in batches in a food processor and add to oat mixture. Mix in parsley, Worcestershire, salt, pepper, onion powder, garlic powder, and cumin thoroughly using your hands or a rubber spatula, adding more processed oats if needed to hold shape.",
        "Roll mixture into 15 tight balls, flatten, and cup the sides to ensure the patties do not have cracks. Place on wax or parchment paper.",
        "Heat oil in a large skillet to 350 degrees F (175 degrees C), or over medium heat. Place patties carefully into the hot oil using your hands or a spatula, working in batches. Cook until browned and crispy, 3 to 5 minutes on each side. Remove and place onto a paper towel-lined plate to drain excess oil, about 2 minutes. Repeat with more oil until all burgers are cooked."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6892345.jpg",
    "ingredients": [
        "2 ½ cups canned black beans, liquid reserved",
        "2 cups rolled oats, or more as needed",
        "2 cups raw sunflower seed kernels",
        "1 (16 ounce) package white mushrooms, stemmed and quartered",
        "1  red bell pepper, cut into 1-inch pieces",
        "1  green bell pepper, cut into 1-inch pieces",
        "1  white onion, cut into 1-inch pieces",
        "3 tablespoons chopped fresh parsley",
        "2 tablespoons vegan Worcestershire sauce",
        "2 tablespoons salt, or more to taste",
        "2 tablespoons ground black pepper",
        "2 tablespoons onion powder",
        "2 tablespoons garlic powder",
        "1 tablespoon ground cumin",
        "vegetable oil as needed"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Black Bean Burgers with Oats",
    "url": "https://www.allrecipes.com/recipe/278506/vegan-black-bean-burgers-with-oats/"
}