{
    "directions": [
        "Heat coconut milk in a saucepan to boiling and simmer until smooth, about 5 minutes.",
        "Combine nutritional yeast, cornstarch, cilantro, salt, paprika, turmeric, cumin, garlic powder, onion powder, and cayenne powder in a bowl. Add 1/2 cup of hot coconut milk and stir until smooth. Slowly add mixture back to the saucepan, whisking the whole time. Bring to a boil and cook for about 5 minutes. Stir in vinegar and liquid smoke. Cook queso until thick, 5 to 10 minutes more. Set aside.",
        "Heat oil in a nonstick pan over medium-high heat. Add tofu and cook until liquid is released, about 5 minutes. Add nutritional yeast and turmeric. Cook, stirring frequently, until tofu is completely yellow and piping hot, 5 to 7 minutes. Quickly stir in chili.",
        "Top each serving with a portion of queso, avocado, cherry tomatoes, and cilantro. Season to taste with salt and black pepper."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "2 (14 ounce) cans full-fat coconut milk (such as Thai Kitchen®)",
        "¼ cup nutritional yeast",
        "4 tablespoons cornstarch",
        "1 tablespoon finely chopped fresh cilantro",
        "2 teaspoons sea salt",
        "1 teaspoon smoked paprika",
        "1 teaspoon turmeric",
        "1 teaspoon ground cumin",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "1 teaspoon cayenne powder",
        "1 teaspoon rice vinegar",
        "¼ teaspoon liquid smoke",
        "2 tablespoons olive oil",
        "1 (16 ounce) package extra-firm tofu - drained, patted dry, and mashed into small pieces",
        "2 tablespoons nutritional yeast",
        "2 teaspoons ground turmeric",
        "¼ cup canned vegan chili",
        "¼ cup halved cherry tomatoes",
        "1  avocado, sliced",
        "¼ cup fresh cilantro, or to taste",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Chili-Cheese Tofu Scramble",
    "url": "https://www.allrecipes.com/recipe/269462/vegan-chili-cheese-tofu-scramble/"
}