{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Whisk flour, cocoa, baking soda, and salt together in a medium bowl.",
        "Combine water and egg replacer in a small bowl. Mix well and let sit until thickened, about 1 minute.",
        "Cream vegan butter, white sugar, and brown sugar together in the bowl of a stand mixer until light and fluffy, about 3 minutes. Mix in egg replacer and vanilla. Gradually mix in dry ingredients until combined. Fold in chocolate chips.",
        "Transfer 1/2 of the dough into a well seasoned 10-inch cast iron skillet. Press down with your fingers to distribute evenly over the bottom of the skillet. Spread peanut butter over the dough. Press remaining dough on top of the peanut butter; it's okay if some peanut butter is poking through.",
        "Bake in the preheated oven until top is firm to the touch and dry and edges have started to pull away from the sides of the skillet, 35 to 40 minutes.",
        "Remove from the oven and let cool for 15 to 20 minutes before slicing; cookie will firm up as it cools."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7631909.jpg",
    "ingredients": [
        "1 cup all-purpose flour",
        "½ cup unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "¼ teaspoon salt",
        "2 tablespoons water",
        "1 tablespoon dry egg replacer (such as Bob's Red Mill®)",
        "½ cup vegan butter, softened",
        "½ cup white sugar",
        "½ cup packed light brown sugar",
        "1 teaspoon vanilla extract",
        "1 (10 ounce) package vegan chocolate mini chips (such as Enjoy Life®)",
        "¼ cup creamy peanut butter"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Double Chocolate-Peanut Butter Skillet Cookie",
    "url": "https://www.allrecipes.com/recipe/278266/vegan-double-chocolate-peanut-butter-skillet-cookie/"
}