{
    "directions": [
        "Sift pastry flour, all-purpose flour, sea salt, and baking soda together in a large mixing bowl. Add coconut oil and begin incorporating into the flour using a pastry cutter or 2 knives. Continue to work oil into flour until mixture takes on a sand-like consistency, 5 to 10 minutes. Use a wooden spoon to mix maple syrup and almond extract into dough. Add water 1 tablespoon at a time; mix using the wooden spoon until dough is putty-like and can be formed into a disc using your hands. Wrap the dough disc in plastic wrap and refrigerate for 5 to 10 minutes.",
        "Remove dough from the refrigerator and place the disc between 2 sheets of parchment paper. If dough feels stiff, let it rest until soft enough to roll, about 5 minutes. Use a rolling pin to roll dough into a circle slightly larger than 9-inches in diameter and roughly 1/8- to 1/4-inch thick. Use a pastry wheel to trim edges to a 9-inch circle. Remove and discard the top sheet of parchment paper. Slide pastry circle, still resting on the bottom parchment paper, onto a baking sheet.",
        "Place strawberries into a mixing bowl and add about 1 tablespoon sugar; toss to coat. Mix remaining sugar and bread crumbs in a separate bowl and pour onto the center of the pastry circle and spread out evenly, leaving a 1 1/2-inch border. Gently arrange strawberries over the bread crumb mixture working from the center out.",
        "Use a pastry wheel or knife to gently score about 6 lines around the perimeter of strawberries on the pastry, allowing you to easily fold over the edges of the tart to create a crust. Place tart in the refrigerator for 15 to 20 minutes.",
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Remove tart from the refrigerator. Bake in the preheated oven for 10 minutes. Remove tart from oven and use a pastry brush to glaze top with maple syrup. Continue baking until the top and edges of crust are firm and browned, about 10 minutes more."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "1 cup whole wheat pastry flour",
        "⅓ cup all-purpose flour",
        "¼ teaspoon sea salt",
        "¼ teaspoon baking soda",
        "½ cup partially solidified coconut oil",
        "3 tablespoons Grade A maple syrup",
        "1 tablespoon alcohol-free almond extract",
        "5 tablespoons ice-cold water, or more as needed",
        "1 ½ cups sliced strawberries, cut into 1/4-inch slices tip to stem",
        "2 tablespoons coconut sugar",
        "1 ½ tablespoons bread crumbs",
        "1 tablespoon Grade A maple syrup, or as desired"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Rustic Strawberry Tart (French Galette)",
    "url": "https://www.allrecipes.com/recipe/272941/vegan-rustic-strawberry-tart-french-galette/"
}