{
    "directions": [
        "Heat olive oil in a large saucepan over medium heat until shimmering. Add celery and onion; cook and stir until the vegetables soften, 3 to 4 minutes. Stir in garlic and cook until fragrant, about 1 minute. Mix in broth, turmeric, ginger, cayenne, cumin, salt, and pepper. Bring to a boil.",
        "Pour carefully into a high-speed blender, cover with a lid, and puree on high speed for 1 minute. Add mashed sweet potato and coconut milk; puree until soup has a creamy consistency, about 4 minutes. Add more broth or water if soup is too thick. Cover and keep warm.",
        "Combine kale, walnuts, nutritional yeast, lemon juice, garlic, salt, and pepper in a blender or food processor.  Process or blend at high speed into a paste, stopping to scrape down the sides of the bowl with a spatula as needed, about 3 minutes. Pour in olive oil, one tablespoon at a time, blending after each addition. Add more oil or lemon juice if pesto seems too thick.",
        "Ladle the warm soup into bowls and spoon some pesto on top of each serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7871290.jpg",
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "½ cup chopped celery",
        "⅔ cup chopped onion",
        "2 cloves garlic, minced",
        "2 cups vegetable broth, or more to taste",
        "¾ teaspoon ground turmeric",
        "¾ teaspoon ground ginger",
        "¼ teaspoon cayenne pepper",
        "¼ teaspoon ground cumin",
        "salt and ground black pepper to taste",
        "2 cups cooked and mashed sweet potatoes",
        "1 cup canned unsweetened coconut milk",
        "1 cup kale, stemmed and chopped",
        "½ cup English walnuts, coarsely chopped",
        "¼ cup nutritional yeast",
        "½  lemon, juiced, or more to taste",
        "1 clove garlic",
        "salt and ground black pepper to taste",
        "5 tablespoons extra-virgin olive oil, or more to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Sweet Potato Soup with Kale Pesto",
    "url": "https://www.allrecipes.com/recipe/279502/vegan-sweet-potato-soup-with-kale-pesto/"
}