{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.",
        "Spread bread cubes on the prepared baking sheet. Toast in the preheated oven until fragrant and slightly golden, about 10 minutes. Remove from oven, leaving oven on. Let bread cool and transfer to a large bowl.",
        "While bread is toasting, melt 2 tablespoons margarine in a large saucepan over medium heat. Add mushrooms and onions. Cook until onions are slightly translucent, about 5 minutes. Add a splash of vegetable broth is moisture is needed. Add sage, rosemary, thyme, salt, and black pepper. Cook and stir with a wooden spoon until combined, about 2 minutes more.",
        "Pour mushroom mixture into the bowl with the toasted bread. Toss to evenly distribute. Pour 6 tablespoons melted margarine and vegan broth over the mixture. Add cranberries, apple, and parsley. Mix thoroughly but gently. Spread stuffing into a casserole dish and cover with aluminum foil.",
        "Bake in the preheated oven for 45 minutes; check at 25 minutes to prevent burning. Uncover and stir gently. Continue baking until top is browned, about 15 minutes more. Allow to cool slightly before serving."
    ],
    "image": "https://www.allrecipes.com/img/misc/og-default.png",
    "ingredients": [
        "1 loaf vegan, gluten-free, brown rice bread (such as Food for Life®), cubed",
        "2 tablespoons vegan margarine (such as Earth Balance®)",
        "1 ½ cups mixed forest mushrooms, diced",
        "1 ¼ cups sweet onion, chopped",
        "2 ½ teaspoons dried sage",
        "1 ½ teaspoons dried rosemary",
        "½ teaspoon dried thyme",
        "sea salt and freshly ground black pepper to taste",
        "6 tablespoons vegan margarine (such as Earth Balance®), melted",
        "1 ½ cups low-sodium vegan broth",
        "8 ounces fresh cranberries",
        "1 cup Granny Smith apple, peeled and chopped",
        "⅓ cup minced fresh parsley"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Stuffing",
    "url": "https://www.allrecipes.com/recipe/264610/vegan-stuffing/"
}