{
    "directions": [
        "Preheat the oven to 425 degrees F (220 degrees C).",
        "Cut sweet potatoes into 25 to 40 smaller \"French fry\"-shaped pieces.",
        "Place sweet potato pieces in a bowl. Coat with 2 tablespoons olive oil. Add 1/4 teaspoon cayenne pepper, 1/2 teaspoon salt, 1/4 teaspoon smoked paprika, and 1/4 teaspoon black pepper. Mix until sweet potatoes are evenly coated; transfer to a large baking sheet.",
        "Place pumpkin seeds into the same bowl. Add 1/4 tablespoon olive oil; season with salt and pepper. Spread pumpkin seeds onto a small baking sheet.",
        "Place sweet potatoes and pumpkin seeds in the preheated oven. Bake pumpkin seeds for 2 minutes; remove and let cool. Bake potatoes, flipping halfway through, about 15 minutes.",
        "Meanwhile, heat 1 tablespoon olive oil in a large saucepan over medium heat. Add black beans, cumin, chili powder, 1/2 teaspoon smoked paprika, a small squeeze of lime juice, and salt and pepper to taste. Stir to combine. Cook until heated through, 5 to 7 minutes.",
        "Combine vegan sour cream, remaining lime juice, 2 tablespoons cilantro, regular paprika, 1 teaspoon cayenne pepper, and salt to taste. Whisk until sour cream flavor is mostly gone and lime-cilantro taste is dominant but not overpowering.",
        "Warm tortillas in pairs in the microwave, 15 to 20 seconds.",
        "Place 2 spoonfuls of beans onto each pair of warmed tortillas. Add 4 sweet potato pieces, a spoonful or two of sour cream mixture, some pumpkin seeds, and some cilantro."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2448&h=1224&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4565580.jpg",
    "ingredients": [
        "2  sweet potatoes, quartered lengthwise",
        "3 ¼ tablespoons olive oil, divided",
        "1 ¼ teaspoons cayenne pepper, divided",
        "½ teaspoon salt",
        "¾ teaspoon smoked paprika, divided",
        "¼ teaspoon ground black pepper",
        "½ cup pumpkin seeds",
        "salt and ground black pepper to taste",
        "2 (16 ounce) cans black beans, drained and rinsed",
        "½ tablespoon ground cumin, or to taste",
        "1 teaspoon chili powder",
        "¾  lime, juiced, divided",
        "6 ounces vegan sour cream",
        "1 bunch fresh cilantro, finely chopped, divided",
        "1 teaspoon paprika",
        "12 (6 inch) white corn tortillas"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Cilantro-Lime, Sweet Potato, and Black Bean Tacos",
    "url": "https://www.allrecipes.com/recipe/264310/vegan-cilantro-lime-sweet-potato-and-black-bean-tacos/"
}