{
    "directions": [
        "Place chickpeas in a large bowl and cover with cold water. Let soak, 8 hours to overnight.",
        "Drain and rinse chickpeas under running cold water. Place in a large pot, cover with several inches of water, and bring to a boil. Reduce heat and simmer until chickpeas are soft, 60 to 75 minutes. Drain.",
        "When chickpeas are halfway done, heat oil in a large pot and cook onions until soft and translucent, about 5 minutes. Stir in garlic and cook until fragrant, about 30 seconds. Add cardamom pods, chile peppers, coriander seeds, turmeric, and mustard seeds and toast for 1 minute. Mix in tomato paste.",
        "Stir butternut squash and carrots into the pot. Add enough water to cover vegetables halfway. Simmer over low heat, partially covered, until all the vegetables are soft, 25 to 35 minutes. Add more water if curry gets too dry.",
        "Mix in cooked chickpeas shortly before serving and heat until warm. Serve sprinkled with cilantro."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2448&h=1224&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5205585.jpg",
    "ingredients": [
        "1 cup dry chickpeas (garbanzo beans)",
        "2 tablespoons vegetable oil",
        "2  onions, chopped",
        "4 cloves garlic, minced",
        "6 pods green cardamom",
        "2  dried red chile peppers, stemmed and seeded",
        "2 teaspoons coriander seeds",
        "2 teaspoons ground turmeric",
        "1 teaspoon black mustard seeds",
        "1 tablespoon tomato paste, or more to taste",
        "1 large butternut squash, peeled and cut into 1-inch cubes",
        "3  carrots, chopped",
        "1 ½ cups water, or as needed",
        "½ bunch fresh cilantro, chopped"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Butternut Squash and Chickpea Curry",
    "url": "https://www.allrecipes.com/recipe/263124/vegan-butternut-squash-and-chickpea-curry/"
}