{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease 15 individual muffin cups or line cups with paper liners.",
        "Combine flour, sugar, cocoa powder, baking soda, and salt in a large bowl. Pour in water, oil, vanilla extract, and vinegar. Mix well into a smooth batter. Spoon batter into the prepared muffin cups, filling each 2/3 full.",
        "Bake in the preheated oven until tops spring back when lightly pressed, 20 to 30 minutes. Cool in the muffin cups for 5 minutes. Transfer to a wire rack and let cool, about 20 minutes.",
        "Cream margarine in a bowl with an electric mixer until soft and fluffy, about 1 minute. Add 1/2 of the confectioners' sugar, 1 tablespoon at a time, while electric mixture is running on low speed. Beat in vanilla soy milk and 1/2 teaspoon vanilla extract. Beat in remaining confectioners' sugar until frosting has desired consistency.",
        "Spoon frosting into a piping bag and pipe over cupcakes. Decorate with sprinkles."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3264&h=1632&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5249679.jpg",
    "ingredients": [
        "1 ¾ cups all-purpose flour",
        "1 cup white sugar",
        "4 tablespoons unsweetened cocoa powder, or more to taste",
        "1 teaspoon baking soda",
        "1 pinch salt",
        "1 cup water",
        "5 tablespoons vegetable oil",
        "1 teaspoon vanilla extract",
        "1 teaspoon white wine vinegar",
        "½ cup vegan margarine",
        "3 ½ cups confectioners' sugar",
        "3 tablespoons vanilla soy milk, or as needed",
        "½ teaspoon vanilla extract",
        "colored sprinkles"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Chocolate Cupcakes with Vanilla Frosting",
    "url": "https://www.allrecipes.com/recipe/263050/vegan-chocolate-cupcakes-with-vanilla-frosting/"
}