{
    "directions": [
        "Check whether green bell peppers will stand on a flat surface; if not, trim bottoms to flatten.",
        "Drain tofu and pat dry. Place in a bowl and mash with a fork until similar to ground beef in texture.",
        "Heat olive oil in a skillet over medium-high heat. Add mashed tofu, cumin, garlic powder, onion powder, and salt. Cook and stir until tofu is golden brown, 7 to 10 minutes.",
        "Mix 2 1/2 cups water and jambalaya rice mix together in a saucepan and bring to a boil. Stir in the tofu mixture. Reduce heat to low, cover, and simmer until rice is tender and water has been absorbed, about 25 minutes.",
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Fill a pot with enough water to cover green bell peppers; bring to a boil and then add green bell peppers. Cook until softened but not mushy, 5 to 10 minutes.",
        "Remove jambalaya mix from heat; let rest for 5 minutes. Fluff with a fork; add 1/2 the tomato soup and stir.",
        "Stand the boiled green peppers in a square glass baking dish. Scoop the rice and tofu mix into the peppers. Spoon remaining tomato soup over the filled peppers. Place any extra filling around the green bell peppers in the bottom of the baking dish.",
        "Bake in the preheated oven until the tomato soup topping begins to darken and dry, 30 to 45 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2016&h=1008&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5570060.jpg",
    "ingredients": [
        "4  green bell peppers - tops, seeds, and membranes removed",
        "1 (16 ounce) package firm tofu",
        "1 tablespoon extra-virgin olive oil, or more to taste",
        "1 teaspoon ground cumin, or more to taste",
        "½ teaspoon garlic powder, or to taste  (Optional)",
        "½ teaspoon onion powder, or to taste  (Optional)",
        "1 pinch salt to taste",
        "1 (8 ounce) package jambalaya rice mix (such as Zatarain's®)",
        "1 (10.75 ounce) can  condensed tomato soup, divided"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Tofu-Stuffed Peppers",
    "url": "https://www.allrecipes.com/recipe/261726/vegan-tofu-stuffed-peppers/"
}