{
    "directions": [
        "Place tofu onto a plate and place another plate on top. Set a 3- to 5-pound weight on top. Press tofu for 20 to 30 minutes; drain and discard the accumulated liquid.",
        "Cube tofu and place in a large bowl. Add ginger, lemon juice, onion powder, adobo, cayenne, paprika, lemon pepper, white pepper, and black pepper to taste; set aside.",
        "Heat a medium-sized nonstick pan over medium heat and add sesame oil. When pan is hot, add tofu, 2 tablespoons shoyu, and teriyaki sauce. Cook and stir for a few seconds, then let tofu cook without stirring for 2 minutes. Repeat stirring and cooking without stirring for 6 minutes total. Flip tofu in the pan like flipping a pancake without a spatula and continue cooking until crispy, 5 to 10 minutes more.",
        "Add 1 tablespoon coconut oil and remaining shoyu to the pan. Mix in and push tofu to one side of the pan to make room. Add remaining coconut oil to the pan. Stir in mushroom and onion and cook until light golden-brown in color, about 5 minutes more.",
        "Mix vegetables and tofu together in the pan and add chile sauce. Cook, stirring every 2 minutes, for 10 minutes more.",
        "Remove tofu from heat and allow to cool briefly. Sprinkle with green onion before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4032&h=2016&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6058147.jpg",
    "ingredients": [
        "¼ (12 ounce) package firm tofu",
        "1 tablespoon minced fresh ginger root",
        "½ tablespoon lemon juice",
        "1 pinch onion powder, or to taste",
        "1 pinch adobo seasoning, or to taste",
        "1 pinch cayenne pepper, or to taste  (Optional)",
        "paprika to taste",
        "1 pinch lemon pepper, or to taste",
        "freshly ground white pepper to taste",
        "freshly ground black pepper to taste",
        "2 tablespoons sesame oil",
        "3 tablespoons shoyu, divided",
        "3 tablespoons garlic teriyaki sauce",
        "2 tablespoons coconut oil",
        "1  button mushroom, sliced",
        "4 tablespoons onion, chopped",
        "2 tablespoons sweet chile sauce",
        "2 tablespoons garlic, minced",
        "⅛ cup chopped green onion"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Spicy Teriyaki Tofu",
    "url": "https://www.allrecipes.com/recipe/269665/vegan-spicy-teriyaki-tofu/"
}