{
    "directions": [
        "Place cashews in a bowl and cover with water. Soak for a minimum of 4 hours to overnight. Drain.",
        "Combine cashews, lemon juice, nutritional yeast, and salt in the bowl of a food processor or a high-powered blender. Blend vegan sour cream until smooth and creamy. Refrigerate until ready to use.",
        "Wash and dry potatoes. Prick several times with a fork and place on a microwave-safe plate. Cook on full power in the microwave until tender, 12 to 14 minutes, turning over once halfway through cooking. Cool for 15 minutes.",
        "Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.",
        "Cut cooked potatoes in half. Scoop out flesh without tearing the potato skin. Transfer flesh to a large bowl and place potato skins on the prepared baking sheet. Add vegan sour cream, chives, almond milk, fake bacon bits, margarine, garlic, salt, and  pepper to the bowl with the potato flesh. Fill each potato skin with the mixture and mound it up high. Sprinkle with paprika.",
        "Bake in the preheated oven until lightly browned, about 30 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3648&h=1824&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6143722.jpg",
    "ingredients": [
        "1 cup cashews",
        "water to cover",
        "1  lemon, juiced",
        "1 tablespoon nutritional yeast",
        "½ teaspoon salt",
        "3 large baking (russet) potatoes",
        "¼ cup chopped fresh chives",
        "¼ cup almond milk",
        "2 tablespoons fake bacon bits",
        "2 tablespoons margarine (such as Earth Balance®)",
        "1 teaspoon minced garlic",
        "salt and freshly ground black pepper to taste",
        "1 pinch paprika, or to taste"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Vegan Double-Stuffed Potatoes",
    "url": "https://www.allrecipes.com/recipe/269364/vegan-double-stuffed-potatoes/"
}