{
    "directions": [
        "Heat oil in a saute pan over medium heat. Add onion; cook for 1 minute. Add garlic, curry, ginger, cumin, salt, red pepper flakes, coriander, cayenne pepper, celery seed, tarragon, and cinnamon. Cook until fragrant, 1 to 2 minutes more. Add potatoes and mixed vegetables. Cook, stirring constantly, for 3 minutes.",
        "Pour broth into the potato mixture. Reduce heat to medium-low. Cook, stirring occasionally, until potatoes are tender and broth is mostly absorbed, 12 to 15 minutes.",
        "Place flour in a medium bowl. Make a well in the center; add salt, oil, and water, in that order. Mix into a stiff dough, roll into a ball, and wrap in plastic wrap. Set aside for 30 minutes.",
        "Divide dough into 8 balls. Roll each ball into a 10-inch circle. Cut each circle in half, moisten the edges, and shape each half into a cone around your finger. Fill dough with 1 to 2 tablespoons of the vegetable mixture. Pinch edges shut.",
        "Heat oil in a large saucepan or deep-fryer. Deep-fry samosas in batches until lightly browned, 2 to 3 minutes. Serve hot."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7543501.jpg",
    "ingredients": [
        "2 tablespoons vegetable oil",
        "½ cup diced onion",
        "2 teaspoons chopped garlic",
        "2 teaspoons curry powder",
        "1 teaspoon ground ginger",
        "1 teaspoon ground cumin",
        "½ teaspoon sea salt",
        "½ teaspoon red pepper flakes",
        "½ teaspoon ground coriander",
        "½ teaspoon cayenne pepper",
        "¼ teaspoon celery seed",
        "¼ teaspoon dried tarragon",
        "⅛ teaspoon ground cinnamon",
        "2 cups diced potatoes",
        "2 cups frozen mixed vegetables, diced",
        "2 cups vegetable broth",
        "2 cups all-purpose flour",
        "1 pinch salt",
        "2 tablespoons vegetable oil",
        "1 cup room-temperature water",
        "oil for frying"
    ],
    "language": "en-US",
    "source": "www.allrecipes.com",
    "tags": [],
    "title": "Veggie Samosas",
    "url": "https://www.allrecipes.com/recipe/267714/veggie-samosas/"
}